FROM maven:3.8-openjdk-18 AS builder

# Указываем рабочую директорию для сборки
WORKDIR /app

# Копируем исходный код проекта
COPY ../.. .


# Собираем проект
RUN mvn clean package -DskipTests

# Этап 3: Запуск приложения
FROM openjdk:18

# Указываем рабочую директорию для запуска
WORKDIR /app

# Копируем собранный JAR файл из предыдущего этапа
COPY --from=builder /app/target/social_network-0.0.1-SNAPSHOT.jar app.jar

# Устанавливаем переменные окружения для работы с базой данных и фронтендом
ENV DB_PORT=5432


# Указываем информацию о контейнере
LABEL maintainer="Маров Егор Андреевич" group="ИКБО-24-21"

# Экспонируем порты
EXPOSE 8080

# Указываем точку монтирования для тома
VOLUME ["/app/data"]


# Указываем точку входа
ENTRYPOINT ["java", "-jar", "app.jar"]

# Включаем команду для выполнения при завершении сборки
ONBUILD RUN echo "Сборка и запуск произведены. Автор: Маров Егор Андреевич"
